--
-- PostgreSQL database dump
--

\restrict YXK4Lg0SfXfa4bx8qzGNS4ljJI0lE4NorD0yvqZQQM49za7Ku5RXQoYGT4bTpFl

-- Dumped from database version 18.6 (Postgres.app)
-- Dumped by pg_dump version 18.6 (Postgres.app)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: questions; Type: TABLE; Schema: public; Owner: gifre
--

CREATE TABLE public.questions (
    id bigint NOT NULL,
    question text NOT NULL,
    answer_letter character varying(20) NOT NULL,
    correct_answer text NOT NULL,
    moodle_question_id bigint,
    quiz_cmid bigint,
    source_attempt_id bigint,
    collected_at timestamp with time zone DEFAULT now() NOT NULL
);


ALTER TABLE public.questions OWNER TO gifre;

--
-- Name: questions_id_seq; Type: SEQUENCE; Schema: public; Owner: gifre
--

CREATE SEQUENCE public.questions_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.questions_id_seq OWNER TO gifre;

--
-- Name: questions_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: gifre
--

ALTER SEQUENCE public.questions_id_seq OWNED BY public.questions.id;


--
-- Name: questions id; Type: DEFAULT; Schema: public; Owner: gifre
--

ALTER TABLE ONLY public.questions ALTER COLUMN id SET DEFAULT nextval('public.questions_id_seq'::regclass);


--
-- Data for Name: questions; Type: TABLE DATA; Schema: public; Owner: gifre
--

COPY public.questions (id, question, answer_letter, correct_answer, moodle_question_id, quiz_cmid, source_attempt_id, collected_at) FROM stdin;
15	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються програмні результати навчання магістрів комп’ютерної інженерії. Як відповідь вказати значення Xmod15, де X - номер слайду.	m	C	34877672	\N	\N	2026-09-11 16:48:20.128334+03
14	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються електронні підручники. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877644	\N	\N	2026-09-11 16:48:20.114859+03
4	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано максимальну оцінку за семестровий тест на іспиті. Як відповідь вказати значення Xmod15, де X - номер слайду.	b	1	34877618	\N	\N	2026-09-11 16:36:57.367336+03
2	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому наведено розклад викладача. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877599	\N	\N	2026-09-11 16:36:57.33659+03
1	Який абзацний відступ (T, міліметрів) встановлено за стилями кафедри ЕОМ для тексту документа? Відповідь дати у вигляді (10T)mod15.	f	5	23527378	\N	\N	2026-09-11 16:36:57.315132+03
9	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються відомості про викладача. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877639	\N	\N	2026-09-11 16:40:32.347396+03
12	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому вказано адресу в домені polynet.lviv.ua електронної пошти викладача. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877596	\N	\N	2026-09-11 16:48:20.085396+03
13	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше показано, де у ВНС знаходяться минулорічні накази на захист МКР з темами МКР і прізвищами керівників. Як відповідь вказати значення Xmod15, де X - номер слайду.	a	0	34877669	\N	\N	2026-09-11 16:48:20.100438+03
19	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказується, чого можуть стосуватися теми МКР магістрів комп’ютерної інженерії . Як відповідь вказати значення Xmod15, де X - номер слайду.	n	D	34877671	\N	\N	2026-09-11 16:48:51.095573+03
11	Скільки порожніх рядків (N) може бути в документі за стилями кафедри ЕОМ? Відповідь дати у вигляді Nmod15.	a	0	23527367	\N	\N	2026-09-11 16:48:20.068709+03
8	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадується перелік питань, які підлягають вивченню.. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877642	\N	\N	2026-09-11 16:40:32.333662+03
20	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадується список рекомендованої навчальної літератури. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877641	\N	\N	2026-09-11 16:48:51.109379+03
5	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадується досвід планування власного часу. Як відповідь вказати значення Xmod15, де X - номер слайду.	c	2	34877660	\N	\N	2026-09-11 16:36:57.381134+03
18	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються електронні навчальні посібники. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877645	\N	\N	2026-09-11 16:48:51.081019+03
7	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадано Освітньо-професійну програму НУЛП щодо Спеціальності 123 Комп'ютерні системи та мережі. Як відповідь вказати значення Xmod15, де X - номер слайду.	e	4	34877664	\N	\N	2026-09-11 16:40:32.318615+03
6	Який розмір шрифту (P, пунктів) встановлено для назви кафедри у документі за стилями кафедри ЕОМ? Відповідь дати у вигляді Pmod15.	o	E	23527364	\N	\N	2026-09-11 16:40:32.301193+03
17	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де пояснено, як можна покращити семестрову оцінку. Як відповідь вказати значення Xmod15, де X - номер слайду.	d	3	34877621	\N	\N	2026-09-11 16:48:51.065683+03
16	Який абзацний відступ (T, міліметрів) встановлено за стилями кафедри ЕОМ для Заголовка 2? Відповідь дати у вигляді (10T)mod15.	f	5	23527376	\N	\N	2026-09-11 16:48:51.047814+03
37	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються матеріали лекцій. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877647	\N	\N	2026-09-11 16:49:48.532489+03
30	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де показано структуру семестру. Як відповідь вказати значення Xmod15, де X - номер слайду.	i	8	34877606	\N	\N	2026-09-11 16:49:22.425542+03
31	Який абзацний відступ (T, міліметрів) встановлено за стилями кафедри ЕОМ для нумерованих абзаців тексту документа? Відповідь дати у вигляді (10T)mod15.	f	5	23527380	\N	\N	2026-09-11 16:49:30.176597+03
35	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому пояснено, що таке комп'ютерна система. Як відповідь вказати значення Xmod15, де X - номер слайду.	g	6	34877603	\N	\N	2026-09-11 16:49:30.239004+03
33	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому вказано адреси електронної пошти викладача. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877595	\N	\N	2026-09-11 16:49:30.209608+03
34	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вказано максимальну оцінку за семестровий тест при повторному вивченні. Як відповідь вказати значення Xmod15, де X - номер слайду.	c	2	34877620	\N	\N	2026-09-11 16:49:30.224764+03
40	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше пояснено, як оцінюється проходження пропущених лекційних тестів на протязі навчальних тижнів. Як відповідь вказати значення Xmod15, де X - номер слайду.	b	1	34877622	\N	\N	2026-09-11 16:49:48.57517+03
28	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де пояснено, що таке компетентність. Як відповідь вказати значення Xmod15, де X - номер слайду.	a	0	34877657	\N	\N	2026-09-11 16:49:22.396802+03
36	Якої ширина (W, міліметрів) повинна бути сторінка документа за стилями кафедри ЕОМ? Відповідь дати у вигляді Wmod15.	a	0	23527353	\N	\N	2026-09-11 16:49:48.516181+03
23	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де на прикладі пояснено, скільки необхідно мати балів за поточний контроль для покращення семестрової оцінки. Як відповідь вказати значення Xmod15, де X - номер слайду.	d	3	34877625	\N	\N	2026-09-11 16:49:05.334057+03
27	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються тест для самопідготовки ТС1. Як відповідь вказати значення Xmod15, де X - номер слайду.	l	B	34877652	\N	\N	2026-09-11 16:49:22.381045+03
26	Якою повинна бути відстань (L) від верхнього колонтитулу до тексту документа за стилями кафедри ЕОМ? Відповідь дати у вигляді (10L)mod15.	f	5	23527360	\N	\N	2026-09-11 16:49:22.364334+03
22	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано, як виглядає робочий журнал викладча. Як відповідь вказати значення Xmod15, де X - номер слайду.	j	9	34877636	\N	\N	2026-09-11 16:49:05.318225+03
39	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де пояснено, з чого складається компетентність. Як відповідь вказати значення Xmod15, де X - номер слайду.	b	1	34877658	\N	\N	2026-09-11 16:49:48.56248+03
32	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де розкрито, у чому полягає дисципліна при вивченні Дослідження і проектування комп'ютеринх систем та мереж. Як відповідь вказати значення Xmod15, де X - номер слайду.	n	D	34877655	\N	\N	2026-09-11 16:49:30.19302+03
21	Який розмір (P, пунктів) встановлено за стилями кафедри ЕОМ для номера і назви рисунка? Відповідь дати у вигляді Pmod15.	m	C	23527386	\N	\N	2026-09-11 16:49:05.299694+03
24	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадується досвід дотримання встановлених правил. Як відповідь вказати значення Xmod15, де X - номер слайду.	c	2	34877661	\N	\N	2026-09-11 16:49:05.348746+03
25	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадується система оцінювання знань студентів. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877643	\N	\N	2026-09-11 16:49:05.363017+03
44	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому пояснено, що таке проектування. Як відповідь вказати значення Xmod15, де X - номер слайду.	g	6	34877602	\N	\N	2026-09-11 16:49:59.37426+03
51	Який розмір (P, пунктів) встановлено за стилями кафедри ЕОМ для назви таблиці? Відповідь дати у вигляді Pmod15.	o	E	23527384	\N	\N	2026-09-11 17:10:32.935358+03
48	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому пояснено, як можна отримати консультацію викладача . Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877598	\N	\N	2026-09-11 17:09:29.571492+03
60	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де показано варіанти отримання державної оцінки на заліку. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877608	\N	\N	2026-09-11 18:06:07.846839+03
50	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де показано, як залежить швидкість засвоєння нового матеріалу від віку. Як відповідь вказати значення Xmod15, де X - номер слайду.	o	E	34877656	\N	\N	2026-09-11 17:09:29.601056+03
59	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де показано, що необхідно зробити для виконання навчального плану. Як відповідь вказати значення Xmod15, де X - номер слайду.	n	D	34877610	\N	\N	2026-09-11 18:06:07.833187+03
57	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де розкрито, у чому полягає регулярність при вивченні Дослідження і проектування комп'ютеринх систем та мереж. Як відповідь вказати значення Xmod15, де X - номер слайду.	n	D	34877654	\N	\N	2026-09-11 18:06:07.801983+03
56	Який розмір шрифту (P, пунктів) встановлено для прізвищ авторів документа за стилями кафедри ЕОМ? Відповідь дати у вигляді Amod15.	o	E	23527363	\N	\N	2026-09-11 18:06:07.783987+03
43	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому вказано адресу в домені lpnu.ua електронної пошти викладача. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877597	\N	\N	2026-09-11 16:49:59.359388+03
47	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються електронні варіанти навчально-методичних матеріалів. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877646	\N	\N	2026-09-11 17:09:29.556324+03
53	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому пояснено, що таке комп'ютерна мережа. Як відповідь вказати значення Xmod15, де X - номер слайду.	g	6	34877604	\N	\N	2026-09-11 17:10:32.968895+03
58	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадано Робочу програму кафедри ЕОМ щодо дисципліни Дослідження і проектування комп'ютерних систем та мереж. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877665	\N	\N	2026-09-11 18:06:07.818137+03
55	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадується лекційний тест Тест1. Як відповідь вказати значення Xmod15, де X - номер слайду.	l	B	34877651	\N	\N	2026-09-11 17:10:32.996905+03
49	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються основні компетентності. Як відповідь вказати значення Xmod15, де X - номер слайду.	c	2	34877659	\N	\N	2026-09-11 17:09:29.586723+03
45	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, який пояснює, що таке ikta_adm . Як відповідь вказати значення Xmod15, де X - номер слайду.	l	B	34877650	\N	\N	2026-09-11 16:49:59.388368+03
54	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де пояснено, як можна виходити з неприємних особливих ситуацій з оцінками. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877626	\N	\N	2026-09-11 17:10:32.983353+03
41	Якою повинна бути відстань (L) від нижнього колонтитулу до тексту документа за стилями кафедри ЕОМ? Відповідь дати у вигляді (10L)mod15.	f	5	23527361	\N	\N	2026-09-11 16:49:59.327026+03
52	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому пояснено, як називається систематичне розслідування з метою встановлення фактів . Як відповідь вказати значення Xmod15, де X - номер слайду.	g	6	34877605	\N	\N	2026-09-11 17:10:32.95323+03
46	Який інтервал (P, пунктів) встановлено за стилями кафедри ЕОМ після Заголовка 1? Відповідь дати у вигляді Pmod15.	a	0	23527371	\N	\N	2026-09-11 17:09:29.537352+03
78	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де показано робочі суботи. Як відповідь вказати значення Xmod15, де X - номер слайду.	j	9	34877607	\N	\N	2026-09-11 18:20:42.898769+03
42	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де пояснено, як розраховується семестрова оцінка на комісії. Як відповідь вказати значення Xmod15, де X - номер слайду.	c	2	34877614	\N	\N	2026-09-11 16:49:59.344278+03
76	Який абзацний відступ (T, міліметрів) встановлено за стилями кафедри ЕОМ для маркованих абзаців тексту документа? Відповідь дати у вигляді (10T)mod15.	f	5	23527379	\N	\N	2026-09-11 18:20:42.864242+03
29	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де наведено електронну пошту адміністратора ВНС від ІКТА. Як відповідь вказати значення Xmod15, де X - номер слайду.	l	B	34877648	\N	\N	2026-09-11 16:49:22.411419+03
81	Який інтервал (P, пунктів) встановлено за стилями кафедри ЕОМ перед Заголовком 1? Відповідь дати у вигляді Pmod15.	a	0	23527370	\N	\N	2026-09-11 18:20:47.549487+03
63	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадано Стандарт вищої освіти України щодо Спеціальності 123 Комп'ютерна інженерія. Як відповідь вказати значення Xmod15, де X - номер слайду.	d	3	34877663	\N	\N	2026-09-11 18:19:34.000643+03
72	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де розкрито складові успішного навчання. Як відповідь вказати значення Xmod15, де X - номер слайду.	m	C	34877653	\N	\N	2026-09-11 18:20:38.424402+03
66	Який розмір (P, пунктів) встановлено за стилями кафедри ЕОМ для номера таблиці? Відповідь дати у вигляді Pmod15.	o	E	23527383	\N	\N	2026-09-11 18:20:31.17985+03
61	Який розмір (P, пунктів) встановлено за стилями кафедри ЕОМ для тексту в таблиці? Відповідь дати у вигляді Pmod15.	m	C	23527385	\N	\N	2026-09-11 18:19:33.9678+03
73	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше показано, як виглядає сторінка ВНС Дослідження та проектування комп'ютерних систем та мереж. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877637	\N	\N	2026-09-11 18:20:38.439229+03
69	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де сказано, коли можна відпрацювати пропущениі лекційні тести. Як відповідь вказати значення Xmod15, де X - номер слайду.	e	4	34877624	\N	\N	2026-09-11 18:20:31.229174+03
65	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вказано, за яких умов можливе дострокове проходження тесту семестрового контролю. Як відповідь вказати значення Xmod15, де X - номер слайду.	o	E	34877612	\N	\N	2026-09-11 18:19:34.02807+03
62	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадуються вміння не заважати іншим. Як відповідь вказати значення Xmod15, де X - номер слайду.	c	2	34877662	\N	\N	2026-09-11 18:19:33.98587+03
67	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано, де знаходиться взірець оформлення файлів звіту. Як відповідь вказати значення Xmod15, де X - номер слайду.	h	7	34877635	\N	\N	2026-09-11 18:20:31.197062+03
68	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вказано, за якими стилями необхідно оформляти звіти з курсового проекту. Як відповідь вказати значення Xmod15, де X - номер слайду.	h	7	34877630	\N	\N	2026-09-11 18:20:31.213643+03
74	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де пояснено, як розраховується семестрова оцінка при повторному вивченні цієї дисципліни. Як відповідь вказати значення Xmod15, де X - номер слайду.	c	2	34877615	\N	\N	2026-09-11 18:20:38.453193+03
71	Яким повинно бути нижнє поле сторінки документа за стилями кафедри ЕОМ (H, міліметрів)? Відповідь дати у вигляді Hmod15.	f	5	23527357	\N	\N	2026-09-11 18:20:38.406598+03
10	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано, куди необхідно завантажувати звіти. Як відповідь вказати значення Xmod15, де X - номер слайду.	h	7	34877632	\N	\N	2026-09-11 16:40:32.359329+03
70	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано, у яких форматах необхідно здавати звіти з курсового проекту. Як відповідь вказати значення Xmod15, де X - номер слайду.	h	7	34877631	\N	\N	2026-09-11 18:20:31.243432+03
85	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де згадується академвідпустка. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877627	\N	\N	2026-09-11 18:20:47.615012+03
121	Який інтервал (P, пунктів) встановлено за стилями кафедри ЕОМ після Заголовка 2? Відповідь дати у вигляді Pmod15.	g	6	23527375	\N	\N	2026-09-11 18:21:24.213981+03
83	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше показано, формування яких фахових компетентностей передбачає вивчення дисципліни ДПКСМ. Як відповідь вказати значення Xmod15, де X - номер слайду.	l	B	34877667	\N	\N	2026-09-11 18:20:47.585666+03
95	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вказано максимальну оцінку за семестровий тест на комісії. Як відповідь вказати значення Xmod15, де X - номер слайду.	c	2	34877619	\N	\N	2026-09-11 18:20:56.821496+03
64	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано максимальну оцінку за лекційні тести. Як відповідь вказати значення Xmod15, де X - номер слайду.	a	0	34877616	\N	\N	2026-09-11 18:19:34.014492+03
97	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому пояснено, що таке дослідження та проектування стосовно комп'ютерних систем та мереж. Як відповідь вказати значення Xmod15, де X - номер слайду.	g	6	34877600	\N	\N	2026-09-11 18:21:01.249551+03
91	Який розмір (P, пунктів) встановлено за стилями кафедри ЕОМ для маркованих абзаців тексту документа ? Відповідь дати у вигляді Pmod15.	o	E	23527382	\N	\N	2026-09-11 18:20:56.759711+03
116	Який розмір шрифту (P, пунктів) встановлено для назви міністерства у документі за стилями кафедри ЕОМ? Відповідь дати у вигляді Pmod15.	o	E	23527365	\N	\N	2026-09-11 18:21:19.675775+03
124	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше показано склад пояснювальної записки до МКР. Як відповідь вказати значення Xmod15, де X - номер слайду.	o	E	34877668	\N	\N	2026-09-11 18:21:24.26458+03
117	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано, з чого повинна складатися назва файлу звіту. Як відповідь вказати значення Xmod15, де X - номер слайду.	h	7	34877633	\N	\N	2026-09-11 18:21:19.695195+03
86	Скільки послідовних пробілів (N) може бути в тексті документа за стилями кафедри ЕОМ? Відповідь дати у вигляді Nmod15.	b	1	23527368	\N	\N	2026-09-11 18:20:52.051066+03
130	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де пояснено, як розраховується семестрова оцінка на іспиті. Як відповідь вказати значення Xmod15, де X - номер слайду.	b	1	34877613	\N	\N	2026-09-11 18:21:28.922795+03
126	Який розмір шрифту (P, пунктів) встановлено для назви документа за стилями кафедри ЕОМ ? Відповідь дати у вигляді Pmod15.	o	E	23527362	\N	\N	2026-09-11 18:21:28.858667+03
106	Який розмір (P, пунктів) встановлено за стилями кафедри ЕОМ для нумерованих абзаців тексту документа ? Відповідь дати у вигляді Pmod15.	o	E	23527381	\N	\N	2026-09-11 18:21:10.396848+03
101	Який розмір тексту (P, пунктів) встановлено за стилями кафедри ЕОМ для стилю Заголовка 1? Відповідь дати у вигляді Pmod15.	o	E	23527369	\N	\N	2026-09-11 18:21:05.722735+03
38	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше показано, формування яких загальних компетентностей передбачає вивчення дисципліни Дослідження і проектування комп'ютерних систем та мереж. Як відповідь вказати значення Xmod15, де X - номер слайду.	l	B	34877666	\N	\N	2026-09-11 16:49:48.548154+03
92	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано максимальну оцінку за поточний контроль на практичних заняттях. Як відповідь вказати значення Xmod15, де X - номер слайду.	a	0	34877617	\N	\N	2026-09-11 18:20:56.776149+03
111	Який абзацний відступ (T, міліметрів) встановлено за стилями кафедри ЕОМ для Заголовка 1? Відповідь дати у вигляді (10T)mod15.	a	0	23527372	\N	\N	2026-09-11 18:21:15.090208+03
132	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де згадується індивідуальний графік навчання. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877628	\N	\N	2026-09-11 18:21:33.46113+03
96	Який розмір (P, пунктів) встановлено за стилями кафедри ЕОМ для тексту документа ? Відповідь дати у вигляді Pmod15.	o	E	23527377	\N	\N	2026-09-11 18:21:01.23501+03
158	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше згадується глосарій. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877640	\N	\N	2026-09-11 18:21:56.326011+03
144	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказано, які символи суворо заборонено використовувати у назвах файлів звіту. Як відповідь вказати значення Xmod15, де X - номер слайду.	h	7	34877634	\N	\N	2026-09-11 18:21:42.481028+03
146	Який розмір тексту (P, пунктів) встановлено за стилями кафедри ЕОМ для стилю Заголовка 2? Відповідь дати у вигляді Pmod15.	o	E	23527373	\N	\N	2026-09-11 18:21:47.143245+03
321	Скільки колонок тексту (N) повинно бути на сторінці документа за стилями кафедри ЕОМ? Відповідь дати у вигляді Amod15.	b	1	23527359	\N	\N	2026-09-11 18:24:39.503214+03
135	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де згадано ikta_adm@lpnu.ua . Як відповідь вказати значення Xmod15, де X - номер слайду.	l	B	34877649	\N	\N	2026-09-11 18:21:33.509707+03
141	Який розмір шрифту (P, пунктів) встановлено для назви університету у документі за стилями кафедри ЕОМ? Відповідь дати у вигляді Pmod15.	o	E	23527366	\N	\N	2026-09-11 18:21:42.433136+03
131	Яким повинно бути верхнє поле сторінки документа за стилями кафедри ЕОМ (H, міліметрів)? Відповідь дати у вигляді Hmod15.	f	5	23527355	\N	\N	2026-09-11 18:21:33.441498+03
136	Яким повинно бути праве поле сторінки документа за стилями кафедри ЕОМ (W, міліметрів)? Відповідь дати у вигляді Wmod15.	a	0	23527358	\N	\N	2026-09-11 18:21:37.895839+03
155	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, на якому пояснено, що таке дослідження. Як відповідь вказати значення Xmod15, де X - номер слайду.	g	6	34877601	\N	\N	2026-09-11 18:21:51.85662+03
3	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де, показано кількість балів за проходження пропущених лекційних тестів після закінчення навчальних тижнів. Як відповідь вказати значення Xmod15, де X - номер слайду.	b	1	34877623	\N	\N	2026-09-11 16:36:57.352547+03
147	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вказано як часто можна достроково проходити семестровий тест при достроковому складанні іспиту. Як відповідь вказати значення Xmod15, де X - номер слайду.	o	E	34877611	\N	\N	2026-09-11 18:21:47.161917+03
301	Який інтервал (P, пунктів) встановлено за стилями кафедри ЕОМ перед Заголовком 2? Відповідь дати у вигляді Pmod15.	g	6	23527374	\N	\N	2026-09-11 18:24:14.095799+03
149	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де згадується продовження сесії. Як відповідь вказати значення Xmod15, де X - номер слайду.	f	5	34877629	\N	\N	2026-09-11 18:21:47.193438+03
112	Вказати слайд презентації DPKSM1_A1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше вказується, що може бути об'єктами професійної діяльності магістрів комп’ютерної інженерії . Як відповідь вказати значення Xmod15, де X - номер слайду.	n	D	34877670	\N	\N	2026-09-11 18:21:15.107715+03
171	Який розмір (P, пунктів) встановлено за стилями кафедри ЕОМ для назви джерела інформації в переліку літератури? Відповідь дати у вигляді Pmod15.	o	E	23527387	\N	\N	2026-09-11 18:22:10.788971+03
271	Якої висоти (H, міліметрів) повинна бути сторінка документа за стилями кафедри ЕОМ? Відповідь дати у вигляді Hmod15.	m	C	23527354	\N	\N	2026-09-11 18:23:44.939334+03
167	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де показано варіанти отримання державної оцінки на іспиті. Як відповідь вказати значення Xmod15, де X - номер слайду.	l	B	34877609	\N	\N	2026-09-11 18:22:05.874466+03
164	Вказати слайд презентації DPKSM1_L1_*_*.ppsx, яка знаходиться у ВНС у день тестування, де вперше показано вміст Загального розділу сторінки дисципліни у ВНС. Як відповідь вказати значення Xmod15, де X - номер слайду.	k	A	34877638	\N	\N	2026-09-11 18:22:01.144387+03
316	Яким повинно бути ліве поле сторінки документу за стилями кафедри ЕОМ (W, міліметрів)? Відповідь дати у вигляді Wmod15.	k	A	23527356	\N	\N	2026-09-11 18:24:28.355232+03
\.


--
-- Name: questions_id_seq; Type: SEQUENCE SET; Schema: public; Owner: gifre
--

SELECT pg_catalog.setval('public.questions_id_seq', 775, true);


--
-- Name: questions questions_pkey; Type: CONSTRAINT; Schema: public; Owner: gifre
--

ALTER TABLE ONLY public.questions
    ADD CONSTRAINT questions_pkey PRIMARY KEY (id);


--
-- Name: questions questions_question_key; Type: CONSTRAINT; Schema: public; Owner: gifre
--

ALTER TABLE ONLY public.questions
    ADD CONSTRAINT questions_question_key UNIQUE (question);


--
-- Name: idx_questions_moodle_question_id; Type: INDEX; Schema: public; Owner: gifre
--

CREATE INDEX idx_questions_moodle_question_id ON public.questions USING btree (moodle_question_id);


--
-- Name: idx_questions_question; Type: INDEX; Schema: public; Owner: gifre
--

CREATE INDEX idx_questions_question ON public.questions USING btree (question);


--
-- PostgreSQL database dump complete
--

\unrestrict YXK4Lg0SfXfa4bx8qzGNS4ljJI0lE4NorD0yvqZQQM49za7Ku5RXQoYGT4bTpFl

